app/views/v1/items/search.jbuilder

  json.collection_count @collections.count
  json.user_count @users.count
---
SELECT COUNT(*) FROM "users" WHERE (first_name like '%hi%' OR last_name like '%hi%' OR username like '%hi%')