app/views/v1/collections/_collection.jbuilder

json.img_count clt.img_count
json.item_ids clt.ids
---
SELECT "items"."id" FROM "items" WHERE 1=0 ORDER BY created_at DESC