app/controllers/v1/collections_controller.rb

    def add
      collection_item = CollectionItem.where(item_id: params[:item_id],
                                             collection_id: params[:collection_id]).first
      collection_item ||= CollectionItem.new(item_id: params[:item_id],
                                             collection_id: params[:collection_id])
      collection_item.deleted_flag = false
      if collection_item.save
---
INSERT INTO "collection_items" ("collection_id", "item_id", "deleted_flag", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["collection_id", 2], ["item_id", 4], ["deleted_flag", 0], ["created_at", "2019-12-15 16:18:40.753505"], ["updated_at", "2019-12-15 16:18:40.753505"]]