app/controllers/v1/collections_controller.rb

    def all
      @collections = Collection.all.newest
---
SELECT "collections".* FROM "collections" ORDER BY created_at DESC

    def create
      collection = Collection.new(collection_params)
      if collection.save
        user = User.find(collection_params[:user_id])
---
INSERT INTO "collections" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-12-15 14:24:04.493292"], ["updated_at", "2019-12-15 14:24:04.493292"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def user
      user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def add
      collection_item = CollectionItem.where(item_id: params[:item_id],
                                             collection_id: params[:collection_id]).first
      collection_item ||= CollectionItem.new(item_id: params[:item_id],
                                             collection_id: params[:collection_id])
      collection_item.deleted_flag = false
      if collection_item.save
        user = User.find(params[:user_id])
---
SELECT "collection_items".* FROM "collection_items" WHERE "collection_items"."item_id" = ? AND "collection_items"."collection_id" = ? ORDER BY "collection_items"."id" ASC LIMIT ?  [["item_id", 4], ["collection_id", 2], ["LIMIT", 1]]
INSERT INTO "collection_items" ("collection_id", "item_id", "deleted_flag", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["collection_id", 2], ["item_id", 4], ["deleted_flag", 0], ["created_at", "2019-12-15 16:18:40.753505"], ["updated_at", "2019-12-15 16:18:40.753505"]]
UPDATE "collection_items" SET "deleted_flag" = ?, "updated_at" = ? WHERE "collection_items"."id" = ?  [["deleted_flag", 1], ["updated_at", "2019-12-15 16:18:48.381859"], ["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def remove
      collection_item = CollectionItem.where(item_id: params[:item_id],
                                             collection_id: params[:collection_id]).first
      collection_item.deleted_flag = true
      if collection_item.save
        user = User.find(params[:user_id])
---
SELECT "collection_items".* FROM "collection_items" WHERE "collection_items"."item_id" = ? AND "collection_items"."collection_id" = ? ORDER BY "collection_items"."id" ASC LIMIT ?  [["item_id", 4], ["collection_id", 2], ["LIMIT", 1]]
UPDATE "collection_items" SET "deleted_flag" = ?, "updated_at" = ? WHERE "collection_items"."id" = ?  [["deleted_flag", 1], ["updated_at", "2019-12-16 02:16:48.105042"], ["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def show
      @clt = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]