app/controllers/v1/items_controller.rb

    def homepage_thumbnail
      @item = Item.horizontal_photo.order('RANDOM()').limit(1).take!
---
SELECT "items".* FROM "items" WHERE (width > height) ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]

    def show
      @item = Item.find(params[:item_id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def endless_item
      @items = Item.all.newest
---
SELECT "items".* FROM "items"

    def following
      user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def like
      @item = Item.find(params[:item_id])
      user = User.find(params[:user_id])
      item_like = ItemLikeMap.where(item_id: @item.id, user_id: user.id).first
      item_like_count = ItemLikeCount.where(item_id: @item.id).first
      if item_like
        item_like.liked_flag = !item_like.liked_flag
        item_like_count.likes += item_like.liked_flag == true ? 1 : -1
      else
        item_like = ItemLikeMap.create!(item_id: @item.id, user_id: user.id, like_time: DateTime.now)
        item_like_count.likes += 1
      end

      if item_like.save && item_like_count.save
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "item_like_maps".* FROM "item_like_maps" WHERE "item_like_maps"."item_id" = ? AND "item_like_maps"."user_id" = ? ORDER BY "item_like_maps"."id" ASC LIMIT ?  [["item_id", 4], ["user_id", 3], ["LIMIT", 1]]
SELECT "item_like_counts".* FROM "item_like_counts" WHERE "item_like_counts"."item_id" = ? ORDER BY "item_like_counts"."id" ASC LIMIT ?  [["item_id", 4], ["LIMIT", 1]]
INSERT INTO "item_like_maps" ("item_id", "user_id", "like_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 4], ["user_id", 3], ["like_time", "-4712-01-01 00:00:00"], ["created_at", "2019-12-15 08:25:48.413664"], ["updated_at", "2019-12-15 08:25:48.413664"]]
UPDATE "item_like_counts" SET "likes" = ?, "updated_at" = ? WHERE "item_like_counts"."id" = ?  [["likes", 0], ["updated_at", "2019-12-15 08:28:23.897360"], ["id", 1]]
UPDATE "item_like_maps" SET "liked_flag" = ?, "updated_at" = ? WHERE "item_like_maps"."id" = ?  [["liked_flag", 0], ["updated_at", "2019-12-15 08:28:23.884474"], ["id", 1]]

    def search
      query = params[:query]

      tags = Tag.where('name like ?', "%#{query}%")
      tag_ids = tags.ids

      item_tags = ItemTagMap.where(tag_id: tag_ids)
      photo_from_tags = Item.where(id: item_tags.pluck(:item_id).uniq)
      photo_from_description = Item.where('description like ?', "%#{query}%")

      @photos = (photo_from_tags + photo_from_description).uniq.reverse!

      clt_tags = CollectionTag.where(tag_id: tag_ids)
      clt_from_tags = Collection.not_private.where(id: clt_tags.pluck(:collection_id).uniq)
      clt_from_attrs = Collection.not_private.where('describe like ? OR name like ?', "%#{query}%", "%#{query}%")

      @collections = (clt_from_tags + clt_from_attrs).uniq.reverse!

      @users = User.where('first_name like ? OR last_name like ? OR username like ?',
                          "%#{query}%",
                          "%#{query}%",
                          "%#{query}%").newest

      @recommends = Tag.random.take(12)
---
SELECT "tags"."id" FROM "tags" WHERE (name like '%hi%')
SELECT "items"."id" FROM "items" WHERE "items"."id" = ? ORDER BY created_at DESC  [["id", 4]]
SELECT "item_tag_maps"."item_id" FROM "item_tag_maps" WHERE "item_tag_maps"."tag_id" IN (?, ?, ?)  [["tag_id", 8], ["tag_id", 22], ["tag_id", 35]]
SELECT "items".* FROM "items" WHERE (description like '%hi%')
SELECT "collection_tags"."collection_id" FROM "collection_tags" WHERE "collection_tags"."tag_id" IN (?, ?, ?)  [["tag_id", 8], ["tag_id", 22], ["tag_id", 35]]
SELECT "collections".* FROM "collections" WHERE (describe like '%hi%' OR name like '%hi%')
SELECT "users".* FROM "users" WHERE (first_name like '%Dev%' OR last_name like '%Dev%' OR username like '%Dev%') ORDER BY created_at DESC
SELECT "tags".* FROM "tags" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 12]]