app/controllers/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "dev3@gmail.com"], ["LIMIT", 1]]
---
    def create
      @user = User.where(email: params[:email]).first