app/controllers/v1/uploads_controller.rb

SELECT "users".* FROM "users" WHERE "users"."authentication_token" = ? ORDER BY "users"."id" ASC LIMIT ?  [["authentication_token", "s6b1ywXfpTAEjNB-aQCH"], ["LIMIT", 1]]
INSERT INTO "item_uploads" ("item_id", "original_file_name", "user_id", "original_width", "original_height", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "items" ("user_id", "content_type", "description", "status", "width", "height", "deleted_flag", "created_at", "updated_at", "cloudinary_id", "cloudinary_ver", "format") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      user_token = params[:auth_token]
      @user = User.where(authentication_token: user_token).first
      @items = []
      if @user
        uploads = params[:list_upload]
        uploads.each do |upload|
          item = Item.new(item_params(@user.id, upload))
          if item.save
            ItemUpload.create(item_id: item.id,
                              user_id: @user.id,
                              original_width: item.width,
                              original_height: item.height,
                              original_file_name: upload[:original_file_name])

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "blonde"], ["created_at", "2019-12-09 13:56:56.032066"], ["updated_at", "2019-12-09 13:56:56.032066"]]
INSERT INTO "item_tag_maps" ("item_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["item_id", 3], ["tag_id", 1], ["created_at", "2019-12-09 13:56:56.079823"], ["updated_at", "2019-12-09 13:56:56.079823"]]
---
    def create_item_tags(item_id, tags, tags_info)
      tags.each do |t_name|
        tag = Tag.where(name: t_name).first
        tag ||= Tag.new(name: t_name)
        tags_info.each do |t_info|
          tag.confidence = t_info[:confidence] if t_info[:tag] == t_name
          break
        end
        tag.save!
        # Create item tag map
        ItemTagMap.create(item_id: item_id, tag_id: tag.id)