app/controllers/v1/users_controller.rb

SELECT "items".* FROM "items" WHERE "items"."user_id" = ? ORDER BY created_at DESC  [["user_id", 3]]
SELECT "users".* FROM "users" WHERE 1=0
---
    def user_info
      @user = User.where(username: params[:username]).first
      if @user
        @photos = []
        @user.items.each do |item|