app/controllers/v1/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "confirmation_token", "confirmation_sent_at", "first_name", "last_name", "username", "created_at", "updated_at", "authentication_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      @user = User.new(user_params)
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "dev2"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."authentication_token" = ? ORDER BY "users"."id" ASC LIMIT ?  [["authentication_token", "s6b1ywXfpTAEjNB-aQCH"], ["LIMIT", 1]]
---
    def user_info
      @user = User.where(username: params[:username]).first
      send_user = User.where(authentication_token: params[:token]).first

SELECT "items".* FROM "items" WHERE (width <= height) ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]
---
    def join_photo
      @item = Item.vertical_photo.random.take!

SELECT "users".* FROM "users" WHERE "users"."authentication_token" = ? ORDER BY "users"."id" ASC LIMIT ?  [["authentication_token", "s6b1ywXfpTAEjNB-aQCH"], ["LIMIT", 1]]
---
    def account_info
      @user = User.where(authentication_token: params[:token]).first

SELECT "users".* FROM "users" WHERE "users"."authentication_token" = ? ORDER BY "users"."id" ASC LIMIT ?  [["authentication_token", "s6b1ywXfpTAEjNB-aQCH"], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "dev updated"], ["updated_at", "2019-12-17 02:05:51.539638"], ["id", 3]]
---
    def update_account
      @user = User.where(authentication_token: params[:token]).first
      if @user && @user.update(update_params)

SELECT "users".* FROM "users" WHERE "users"."authentication_token" = ? ORDER BY "users"."id" ASC LIMIT ?  [["authentication_token", "s6b1ywXfpTAEjNB-aQCH"], ["LIMIT", 1]]
UPDATE "users" SET "avatar" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar", "http://res.cloudinary.com/flask-image/image/upload/v1576547756/Upfamous/rysyorwvedm8mua9mbji.jpg"], ["updated_at", "2019-12-17 01:55:56.629218"], ["id", 3]]
---
    def update_ava
      @user = User.where(authentication_token: params[:token]).first
      if @user && @user.update(update_ava_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "dev2"], ["LIMIT", 1]]
SELECT "user_followings".* FROM "user_followings" WHERE "user_followings"."source_user_id" = ? AND "user_followings"."target_user_id" = ? ORDER BY "user_followings"."id" ASC LIMIT ?  [["source_user_id", 3], ["target_user_id", 2], ["LIMIT", 1]]
INSERT INTO "user_followings" ("source_user_id", "target_user_id", "follow_flag", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["source_user_id", 3], ["target_user_id", 2], ["follow_flag", 1], ["created_at", "2019-12-17 02:51:35.780742"], ["updated_at", "2019-12-17 02:51:35.780742"]]
UPDATE "user_followings" SET "follow_flag" = ?, "updated_at" = ? WHERE "user_followings"."id" = ?  [["follow_flag", 0], ["updated_at", "2019-12-17 02:52:40.418479"], ["id", 2]]
---
    def follow
      root = User.find(params[:id])
      target = User.where(username: params[:username]).first
      user_follow = UserFollowing.where(source_user_id: root.id, target_user_id: target.id).first
      user_follow ||= UserFollowing.new(source_user_id: root.id, target_user_id: target.id)
      user_follow.follow_flag = user_follow.follow_flag ? !user_follow.follow_flag : true

      if user_follow.save!