app/models/collection.rb

  def feature_imgs
    ids = collection_items.active.pluck(:item_id)
    Item.where(id: ids).newest.take(3)
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 4], ["LIMIT", 3]]