app/models/collection.rb

  def items
    ids = collection_items.active.pluck(:item_id)
    Item.where(id: ids).newest
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY created_at DESC  [["id", 4]]