app/models/user.rb

SELECT "user_followings"."source_user_id" FROM "user_followings" WHERE "user_followings"."source_user_id" = ? AND "user_followings"."target_user_id" = ? AND "user_followings"."follow_flag" = ?  [["source_user_id", 3], ["target_user_id", 1], ["follow_flag", 1]]
---
  def active_follower
    users = UserFollowing.where(source_user_id: follower_ids, target_user_id: id, follow_flag: true)